czopik/GateOS/stm32/Src/main.c
  static uint8_t  checkRemote = 0;
  static uint16_t distance;
  static float    steering;
  static int      distanceErr;  
  static int      lastDistance = 0;
  static uint16_t transpotter_counter = 0;
#endif

static int16_t    speed;                // local variable for speed. -1000 to 1000
#ifndef VARIANT_TRANSPOTTER
  static int16_t  steer;                // local variable for steering. -1000 to 1000
  static int16_t  steerRateFixdt;       // local fixed-point variable for steering rate limiter
  static int16_t  speedRateFixdt;       // local fixed-point variable for speed rate limiter
  static int32_t  steerFixdt;           // local fixed-point variable for steering low-pass filter
  static int32_t  speedFixdt;           // local fixed-point variable for speed low-pass filter
#endif

static uint32_t    buzzerTimer_prev = 0;
static uint32_t    inactivity_timeout_counter;
#if defined(VARIANT_HOVERCAR) || defined(ELECTRIC_BRAKE_ENABLE)
static MultipleTap MultipleTapBrake;    // define multiple tap functionality for the Brake pedal
#endif

static uint16_t rate = RATE; // Adjustable rate to support multiple drive modes on startup

#ifdef MULTI_MODE_DRIVE
  static uint8_t drive_mode;
  static uint16_t max_speed;
#endif


int main(void) {

  HAL_Init();
  __HAL_RCC_AFIO_CLK_ENABLE();
  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
  /* System interrupt init*/
  /* MemoryManagement_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(MemoryManagement_IRQn, 0, 0);
  /* BusFault_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(BusFault_IRQn, 0, 0);
  /* UsageFault_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(UsageFault_IRQn, 0, 0);
  /* SVCall_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SVCall_IRQn, 0, 0);
  /* DebugMonitor_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DebugMonitor_IRQn, 0, 0);
  /* PendSV_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(PendSV_IRQn, 0, 0);
  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

  SystemClock_Config();

  __HAL_RCC_DMA1_CLK_DISABLE();
  MX_GPIO_Init();
  MX_TIM_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  BLDC_Init();        // BLDC Controller Init

  HAL_GPIO_WritePin(OFF_PORT, OFF_PIN, GPIO_PIN_SET);   // Activate Latch
  Input_Lim_Init();   // Input Limitations Init
  Input_Init();       // Input Init

  HAL_ADC_Start(&hadc1);
  HAL_ADC_Start(&hadc2);

  poweronMelody();
  HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET);

  // Gate/ESP32 mode: start DISARMED, enforce default SPD request at runtime
  #ifdef VARIANT_USART
    // Gate/USART variant: start DISARMED by default for safety (do not enable motors until explicit ARM)
    hb_motor_armed = 0;
    ctrlModReqRaw = SPD_MODE;
    ctrlModReq = SPD_MODE;
  #endif
  
  int32_t board_temp_adcFixdt = adc_buffer.temp << 16;  // Fixed-point filter output initialized with current ADC converted to fixed-point
  int16_t board_temp_adcFilt  = adc_buffer.temp;

  #ifdef MULTI_MODE_DRIVE
    if (adc_buffer.l_tx2 > input1[0].min + 50 && adc_buffer.l_rx2 > input2[0].min + 50) {
      drive_mode = 2;
      max_speed = MULTI_MODE_DRIVE_M3_MAX;
      rate = MULTI_MODE_DRIVE_M3_RATE;
      rtP_Left.n_max = rtP_Right.n_max = MULTI_MODE_M3_N_MOT_MAX << 4;
      rtP_Left.i_max = rtP_Right.i_max = (MULTI_MODE_M3_I_MOT_MAX * A2BIT_CONV) << 4;
    } else if (adc_buffer.l_tx2 > input1[0].min + 50) {
      drive_mode = 1;
      max_speed = MULTI_MODE_DRIVE_M2_MAX;
      rate = MULTI_MODE_DRIVE_M2_RATE;
      rtP_Left.n_max = rtP_Right.n_max = MULTI_MODE_M2_N_MOT_MAX << 4;
      rtP_Left.i_max = rtP_Right.i_max = (MULTI_MODE_M2_I_MOT_MAX * A2BIT_CONV) << 4;
    } else {
      drive_mode = 0;
      max_speed = MULTI_MODE_DRIVE_M1_MAX;
      rate = MULTI_MODE_DRIVE_M1_RATE;
      rtP_Left.n_max = rtP_Right.n_max = MULTI_MODE_M1_N_MOT_MAX << 4;
      rtP_Left.i_max = rtP_Right.i_max = (MULTI_MODE_M1_I_MOT_MAX * A2BIT_CONV) << 4;
    }

    printf("Drive mode %i selected: max_speed:%i acc_rate:%i \r\n", drive_mode, max_speed, rate);
  #endif

  // In gate/UART mode the controller should resume automatically after power
  // is restored, without waiting for a manual power-button cycle.
  #ifndef VARIANT_USART
    while(HAL_GPIO_ReadPin(BUTTON_PORT, BUTTON_PIN)) { HAL_Delay(10); }
  #endif

  #ifdef MULTI_MODE_DRIVE
    // Wait until triggers are released. Exit if timeout elapses (to unblock if the inputs are not calibrated)
    int iTimeout = 0;
    while((adc_buffer.l_rx2 + adc_buffer.l_tx2) >= (input1[0].min + input2[0].min) && iTimeout++ < 300) {
      HAL_Delay(10);
    }
  #endif

  while(1) {
    if (buzzerTimer - buzzerTimer_prev > 16*DELAY_IN_MAIN_LOOP) {   // 1 ms = 16 ticks buzzerTimer

    readCommand();                        // Read Command: input1[inIdx].cmd, input2[inIdx].cmd
    calcAvgSpeed();                       // Calculate average measured speed: speedAvg, speedAvgAbs

    #ifdef VARIANT_USART
      // Additional command shaping for smoother direction changes and less jerk.
      // This is independent from the existing global filters and focuses on UART gate commands.
      {
        int16_t cmd_raw = input2[inIdx].cmd;
        int16_t d = cmd_raw - gate_cmd_shaped;
        const int16_t step_norm = 24;
        const int16_t step_reverse = 12;
        const uint8_t reversing =
          ((gate_cmd_shaped > 40) && (cmd_raw < -40)) ||
          ((gate_cmd_shaped < -40) && (cmd_raw > 40));

        if (reversing) {
          if (gate_cmd_shaped > 0) {
            gate_cmd_shaped -= (gate_cmd_shaped > step_reverse) ? step_reverse : gate_cmd_shaped;
          } else if (gate_cmd_shaped < 0) {
            int16_t a = (int16_t)(-gate_cmd_shaped);
            gate_cmd_shaped += (a > step_reverse) ? step_reverse : a;
          }
        } else {
          if (d > step_norm) d = step_norm;
          if (d < -step_norm) d = -step_norm;
          gate_cmd_shaped += d;
        }
        input2[inIdx].cmd = gate_cmd_shaped;
      }
    #endif

    #if defined(FEEDBACK_SERIAL_USART2) || defined(FEEDBACK_SERIAL_USART3)
      hb_cmd_age_ms = HAL_GetTick() - last_cmd_ms;
      // FAILSAFE based on last valid binary command timestamp
      if (hb_motor_armed && (hb_cmd_age_ms > DISARM_CMD_MS)) {
        hb_motor_armed = 0;
        failsafe_active = 1;
      } else if (hb_motor_armed && (hb_cmd_age_ms > FAILSAFE_CMD_MS)) {
        failsafe_active = 1;
      } else {
        failsafe_active = 0;
      }
    #endif

    #if defined(FEEDBACK_SERIAL_USART2) || defined(FEEDBACK_SERIAL_USART3)
      if (telemetry_zero_req) {
        dist_mm_x1000 = 0;
        dist_mm = 0;
        dist_last_ms = 0;
        telemetry_zero_req = 0;
      }
      {
        int32_t rpm_meas = speedAvg;
        if (ABS(rpm_meas) <= 5) {
          rpm_meas = 0;
        }
        int32_t speed_mm_s = (rpm_meas * MM_PER_REV) / 60;
        uint32_t now_ms = HAL_GetTick();
        uint32_t dt_ms = (dist_last_ms == 0) ? (uint32_t)DELAY_IN_MAIN_LOOP : (now_ms - dist_last_ms);
        // clamp dt to reasonable bounds to avoid spikes
        if (dt_ms < 1) dt_ms = 1;
        if (dt_ms > 200) dt_ms = 200;
        dist_last_ms = now_ms;
        dist_mm_x1000 += speed_mm_s * (int32_t)dt_ms;
        dist_mm = dist_mm_x1000 / 1000;
      }
    #endif

    #ifndef VARIANT_TRANSPOTTER
      #ifndef VARIANT_USART
        // ####### MOTOR ENABLING: Only if the initial input is very small (for SAFETY) #######
        if (enable == 0 && !rtY_Left.z_errCode && !rtY_Right.z_errCode && 
            ABS(input1[inIdx].cmd) < 50 && ABS(input2[inIdx].cmd) < 50){
          beepShort(6);                     // make 2 beeps indicating the motor enable
          beepShort(4); HAL_Delay(100);
          steerFixdt = speedFixdt = 0;      // reset filters
          enable = 1;                       // enable motors
          #if defined(DEBUG_SERIAL_USART2) || defined(DEBUG_SERIAL_USART3)
          printf("-- Motors enabled --\r\n");
          #endif
        }
      #endif

      // ####### VARIANT_HOVERCAR #######
      #if defined(VARIANT_HOVERCAR) || defined(VARIANT_SKATEBOARD) || defined(ELECTRIC_BRAKE_ENABLE)
        uint16_t speedBlend;                                        // Calculate speed Blend, a number between [0, 1] in fixdt(0,16,15)
        speedBlend = (uint16_t)(((CLAMP(speedAvgAbs,10,60) - 10) << 15) / 50); // speedBlend [0,1] is within [10 rpm, 60rpm]
      #endif

