czopik/GateOS/stm32/Src/main.c
      #ifdef STANDSTILL_HOLD_ENABLE
        standstillHold();                                           // Apply Standstill Hold functionality. Only available and makes sense for VOLTAGE or TORQUE Mode
      #endif

      #ifdef VARIANT_HOVERCAR
      if (inIdx == CONTROL_ADC) {                                   // Only use use implementation below if pedals are in use (ADC input)
        if (speedAvgAbs < 60) {                                     // Check if Hovercar is physically close to standstill to enable Double tap detection on Brake pedal for Reverse functionality
          multipleTapDet(input1[inIdx].cmd, HAL_GetTick(), &MultipleTapBrake); // Brake pedal in this case is "input1" variable
        }

        if (input1[inIdx].cmd > 30) {                               // If Brake pedal (input1) is pressed, bring to 0 also the Throttle pedal (input2) to avoid "Double pedal" driving
          input2[inIdx].cmd = (int16_t)((input2[inIdx].cmd * speedBlend) >> 15);
          cruiseControl((uint8_t)rtP_Left.b_cruiseCtrlEna);         // Cruise control deactivated by Brake pedal if it was active
        }
      }
      #endif

      #ifdef ELECTRIC_BRAKE_ENABLE
        electricBrake(speedBlend, MultipleTapBrake.b_multipleTap);  // Apply Electric Brake. Only available and makes sense for TORQUE Mode
      #endif

      #ifdef VARIANT_HOVERCAR
      if (inIdx == CONTROL_ADC) {                                   // Only use use implementation below if pedals are in use (ADC input)
        if (speedAvg > 0) {                                         // Make sure the Brake pedal is opposite to the direction of motion AND it goes to 0 as we reach standstill (to avoid Reverse driving by Brake pedal) 
          input1[inIdx].cmd = (int16_t)((-input1[inIdx].cmd * speedBlend) >> 15);
        } else {
          input1[inIdx].cmd = (int16_t)(( input1[inIdx].cmd * speedBlend) >> 15);
        }
      }
      #endif

      #ifdef VARIANT_SKATEBOARD
        if (input2[inIdx].cmd < 0) {                                // When Throttle is negative, it acts as brake. This condition is to make sure it goes to 0 as we reach standstill (to avoid Reverse driving) 
          if (speedAvg > 0) {                                       // Make sure the braking is opposite to the direction of motion
            input2[inIdx].cmd  = (int16_t)(( input2[inIdx].cmd * speedBlend) >> 15);
          } else {
            input2[inIdx].cmd  = (int16_t)((-input2[inIdx].cmd * speedBlend) >> 15);
          }
        }
      #endif

      // ####### LOW-PASS FILTER #######
      rateLimiter16(input1[inIdx].cmd, rate, &steerRateFixdt);
      rateLimiter16(input2[inIdx].cmd, rate, &speedRateFixdt);
      filtLowPass32(steerRateFixdt >> 4, FILTER, &steerFixdt);
      filtLowPass32(speedRateFixdt >> 4, FILTER, &speedFixdt);
      steer = (int16_t)(steerFixdt >> 16);  // convert fixed-point to integer
      speed = (int16_t)(speedFixdt >> 16);  // convert fixed-point to integer

      // ####### VARIANT_HOVERCAR #######
      #ifdef VARIANT_HOVERCAR
      if (inIdx == CONTROL_ADC) {               // Only use use implementation below if pedals are in use (ADC input)

        #ifdef MULTI_MODE_DRIVE
        if (speed >= max_speed) {
          speed = max_speed;
        }
        #endif

        if (!MultipleTapBrake.b_multipleTap) {  // Check driving direction
          speed = steer + speed;                // Forward driving: in this case steer = Brake, speed = Throttle
        } else {
          speed = steer - speed;                // Reverse driving: in this case steer = Brake, speed = Throttle
        }
        steer = 0;                              // Do not apply steering to avoid side effects if STEER_COEFFICIENT is NOT 0
      }
      #endif

      #if defined(TANK_STEERING) && !defined(VARIANT_HOVERCAR) && !defined(VARIANT_SKATEBOARD) 
        // Tank steering (no mixing)
        cmdL = steer; 
        cmdR = speed;
      #else 
        // ####### MIXER #######
        mixerFcn(speed << 4, steer << 4, &cmdR, &cmdL);   // This function implements the equations above
      #endif


      // ####### SET OUTPUTS (if the target change is less than +/- 100) #######
      #ifdef INVERT_R_DIRECTION
        pwmr = cmdR;
      #else
        pwmr = -cmdR;
      #endif
      #ifdef INVERT_L_DIRECTION
        pwml = -cmdL;
      #else
        pwml = cmdL;
      #endif

      #ifdef VARIANT_USART
        // Gate mode: single motor (LEFT) + remote ARM/DISARM + failsafe + optional electric brake pulse
        enable = hb_motor_armed ? 1 : 0;

        // Force right channel to 0 in all cases
        #ifndef MOTOR_RIGHT_ENA
          pwmr = 0;
          cmdR = 0;
        #endif

        // Direction reversal zero-cross guard:
        // If requested command sign differs from measured motion sign and speed is still high,
        // apply a small opposite torque brake (TRQ mode) until near standstill,
        // then allow opposite direction command.
        if (hb_motor_armed && !failsafe_active && !eb_pulse_active) {
          int8_t req_sign = 0;
          int8_t mot_sign = 0;
          int16_t req_cmd = input2[inIdx].cmd;

          // Requested sign should be taken from input command (post input processing),
          // not from already-filtered motor setpoint, otherwise reversal is detected too late.
          if (req_cmd > 0) {
            req_sign = 1;
          } else if (req_cmd < 0) {
            req_sign = -1;
          }

          if (speedAvg > REV_ALLOW_RPM) {
            mot_sign = 1;
          } else if (speedAvg < -REV_ALLOW_RPM) {
            mot_sign = -1;
          }

          if (rev_guard_active) {
            if (speedAvgAbs <= REV_ALLOW_RPM) {
              rev_guard_active = 0;
              ctrlModReqRaw = SPD_MODE;
              ctrlModReq = SPD_MODE;
            } else {
              ctrlModReqRaw = TRQ_MODE;
              ctrlModReq = TRQ_MODE;
              {
                int16_t sign = 0;
                if (speedAvg > 0) {
                  sign = -1;
                } else if (speedAvg < 0) {
                  sign = 1;
                }
                pwml = (int16_t)(sign * REV_BRAKE_LVL);
                cmdL = pwml;
                pwmr = 0;
                cmdR = 0;
              }
            }
          }

          if (!rev_guard_active && req_sign != 0 && mot_sign != 0 && req_sign != mot_sign && speedAvgAbs >= REV_GUARD_RPM) {
            rev_guard_active = 1;
            ctrlModReqRaw = TRQ_MODE;
            ctrlModReq = TRQ_MODE;
            {
              int16_t sign = 0;
              if (speedAvg > 0) {
                sign = -1;
              } else if (speedAvg < 0) {
                sign = 1;
              }
              pwml = (int16_t)(sign * REV_BRAKE_LVL);
              cmdL = pwml;
              pwmr = 0;
              cmdR = 0;
            }
          }
        } else {
          rev_guard_active = 0;
        }

        // Failsafe: soft stop / disarm (setpoint=0, PWM off)
        if (!hb_motor_armed || failsafe_active) {
          pwml = 0;
          pwmr = 0;
          cmdL = 0;
          cmdR = 0;
          rtP_Left.b_cruiseCtrlEna = 0;
          rtP_Right.b_cruiseCtrlEna = 0;
        }

