czopik/GateOS/stm32/Src/main.c
        // Electric brake pulse (EBP ms level): only when armed and low rpm (validated on RX side too)
        if (eb_pulse_req && hb_motor_armed && !failsafe_active && speedAvgAbs <= 200) {
          eb_pulse_active = 1;
          eb_pulse_end_ms = HAL_GetTick() + (uint32_t)eb_pulse_ms;
          last_eb_ms = eb_pulse_ms;
          last_eb_lvl = eb_pulse_lvl;
          eb_pulse_req = 0;
        }
        if (eb_pulse_active) {
          if (HAL_GetTick() >= eb_pulse_end_ms) {
            eb_pulse_active = 0;
            ctrlModReqRaw = SPD_MODE;
            ctrlModReq = SPD_MODE;
            pwml = 0;
            pwmr = 0;
            cmdL = 0;
            cmdR = 0;
          } else {
            ctrlModReqRaw = TRQ_MODE;
            ctrlModReq = TRQ_MODE;
            int16_t lvl = (int16_t)CLAMP((int32_t)last_eb_lvl, 0, 500);
            int16_t sign = 0;
            if (speedAvg > 0) {
              sign = -1;
            } else if (speedAvg < 0) {
              sign = 1;
            }
            pwml = (int16_t)(sign * lvl);
            pwmr = 0;
            cmdL = pwml;
            cmdR = 0;
          }
        }
      #endif
    #endif

    #ifdef VARIANT_TRANSPOTTER
      distance    = CLAMP(input1[inIdx].cmd - 180, 0, 4095);
      steering    = (input2[inIdx].cmd - 2048) / 2048.0;
      distanceErr = distance - (int)(setDistance * 1345);

      if (nunchuk_connected == 0) {
        cmdL = cmdL * 0.8f + (CLAMP(distanceErr + (steering*((float)MAX(ABS(distanceErr), 50)) * ROT_P), -850, 850) * -0.2f);
        cmdR = cmdR * 0.8f + (CLAMP(distanceErr - (steering*((float)MAX(ABS(distanceErr), 50)) * ROT_P), -850, 850) * -0.2f);
        if (distanceErr > 0) {
          enable = 1;
        }
        if (distanceErr > -300) {
          #ifdef INVERT_R_DIRECTION
            pwmr = cmdR;
          #else
            pwmr = -cmdR;
          #endif
          #ifdef INVERT_L_DIRECTION
            pwml = -cmdL;
          #else
            pwml = cmdL;
          #endif

          if (checkRemote) {
            if (!HAL_GPIO_ReadPin(LED_PORT, LED_PIN)) {
              //enable = 1;
            } else {
              enable = 0;
            }
          }
        } else {
          enable = 0;
        }
        timeoutCntGen = 0;
        timeoutFlgGen = 0;
      }

      if (timeoutFlgGen) {
        pwml = 0;
        pwmr = 0;
        enable = 0;
        #ifdef SUPPORT_LCD
          LCD_SetLocation(&lcd,  0, 0); LCD_WriteString(&lcd, "Len:");
          LCD_SetLocation(&lcd,  8, 0); LCD_WriteString(&lcd, "m(");
          LCD_SetLocation(&lcd, 14, 0); LCD_WriteString(&lcd, "m)");
        #endif
        HAL_Delay(1000);
        nunchuk_connected = 0;
      }

      if ((distance / 1345.0) - setDistance > 0.5 && (lastDistance / 1345.0) - setDistance > 0.5) { // Error, robot too far away!
        enable = 0;
        beepLong(5);
        #ifdef SUPPORT_LCD
          LCD_ClearDisplay(&lcd);
          HAL_Delay(5);
          LCD_SetLocation(&lcd, 0, 0); LCD_WriteString(&lcd, "Emergency Off!");
          LCD_SetLocation(&lcd, 0, 1); LCD_WriteString(&lcd, "Keeper too fast.");
        #endif
        poweroff();
      }

      #ifdef SUPPORT_NUNCHUK
        if (transpotter_counter % 500 == 0) {
          if (nunchuk_connected == 0 && enable == 0) {
              if(Nunchuk_Read() == NUNCHUK_CONNECTED) {
                #ifdef SUPPORT_LCD
                  LCD_SetLocation(&lcd, 0, 0); LCD_WriteString(&lcd, "Nunchuk Control");
                #endif
                nunchuk_connected = 1;
	      }
	    } else {
              nunchuk_connected = 0;
	    }
          }
        }   
      #endif

      #ifdef SUPPORT_LCD
        if (transpotter_counter % 100 == 0) {
          if (LCDerrorFlag == 1 && enable == 0) {

          } else {
            if (nunchuk_connected == 0) {
              LCD_SetLocation(&lcd,  4, 0); LCD_WriteFloat(&lcd,distance/1345.0,2);
              LCD_SetLocation(&lcd, 10, 0); LCD_WriteFloat(&lcd,setDistance,2);
            }
            LCD_SetLocation(&lcd,  4, 1); LCD_WriteFloat(&lcd,batVoltage, 1);
            // LCD_SetLocation(&lcd, 11, 1); LCD_WriteFloat(&lcd,MAX(ABS(currentR), ABS(currentL)),2);
          }
        }
      #endif
      transpotter_counter++;
    #endif

    // ####### SIDEBOARDS HANDLING #######
    #if defined(SIDEBOARD_SERIAL_USART2)
      sideboardSensors((uint8_t)Sideboard_L.sensors);
    #endif
    #if defined(FEEDBACK_SERIAL_USART2)
      sideboardLeds(&sideboard_leds_L);
    #endif
    #if defined(SIDEBOARD_SERIAL_USART3)
      sideboardSensors((uint8_t)Sideboard_R.sensors);
    #endif
    #if defined(FEEDBACK_SERIAL_USART3)
      sideboardLeds(&sideboard_leds_R);
    #endif
    

    // ####### CALC BOARD TEMPERATURE #######
    filtLowPass32(adc_buffer.temp, TEMP_FILT_COEF, &board_temp_adcFixdt);
    board_temp_adcFilt  = (int16_t)(board_temp_adcFixdt >> 16);  // convert fixed-point to integer
    board_temp_deg_c    = (TEMP_CAL_HIGH_DEG_C - TEMP_CAL_LOW_DEG_C) * (board_temp_adcFilt - TEMP_CAL_LOW_ADC) / (TEMP_CAL_HIGH_ADC - TEMP_CAL_LOW_ADC) + TEMP_CAL_LOW_DEG_C;

    // ####### CALC CALIBRATED BATTERY VOLTAGE #######
    batVoltageCalib = batVoltage * gate_battery_calibration_cv() / BAT_CALIB_ADC;

    // ####### CALC DC LINK CURRENT #######
    left_dc_curr  = -(rtU_Left.i_DCLink * 100) / A2BIT_CONV;   // Left DC Link Current * 100 
    right_dc_curr = -(rtU_Right.i_DCLink * 100) / A2BIT_CONV;  // Right DC Link Current * 100
    dc_curr       = left_dc_curr + right_dc_curr;            // Total DC Link Current * 100

    // ####### DEBUG SERIAL OUT #######
    #if defined(DEBUG_SERIAL_USART2) || defined(DEBUG_SERIAL_USART3)
      if (main_loop_counter % 25 == 0) {    // Send data periodically every 125 ms      
        #if defined(DEBUG_SERIAL_PROTOCOL)
          process_debug();
        #else
          printf("in1:%i in2:%i cmdL:%i cmdR:%i BatADC:%i BatV:%i TempADC:%i Temp:%i \r\n",
            input1[inIdx].raw,        // 1: INPUT1
            input2[inIdx].raw,        // 2: INPUT2
            cmdL,                     // 3: output command: [-1000, 1000]
            cmdR,                     // 4: output command: [-1000, 1000]
            adc_buffer.batt1,         // 5: for battery voltage calibration
            batVoltageCalib,          // 6: for verifying battery voltage calibration
            board_temp_adcFilt,       // 7: for board temperature calibration
            board_temp_deg_c);        // 8: for verifying board temperature calibration
        #endif
      }
    #endif

    // ####### TELEMETRY SERIAL OUT (ASCII) #######
    #if defined(FEEDBACK_SERIAL_USART2) || defined(FEEDBACK_SERIAL_USART3)
      {
        uint8_t send_now = 0;
        uint16_t telemetry_ticks = (uint16_t)(TELEMETRY_PERIOD_MS / DELAY_IN_MAIN_LOOP);
        if (telemetry_ticks == 0) {
          telemetry_ticks = 1;
        }
        if (++telemetry_tick >= telemetry_ticks) {
          telemetry_tick = 0;
          send_now = 1;
        }
        if (telemetry_get_req) {
          telemetry_get_req = 0;
          send_now = 1;
        }
        if (send_now) {
          int16_t rpm_meas = speedAvg;
          int16_t rpm_abs = ABS(rpm_meas);
          int dir = 0;
          uint16_t fault = (uint16_t)rtY_Left.z_errCode;
          int iA = ABS(left_dc_curr);  // [A*100] Absolute DC link current of active (LEFT) channel
          char tel_buf[220];
          const char *mode_str = "UNK";

          if (rpm_abs <= 5) {
            rpm_meas = 0;
            dir = 0;
          } else if (rpm_meas > 0) {
            dir = 1;
          } else {
            dir = -1;
          }

          if (ctrlModReqRaw == SPD_MODE) {
            mode_str = "SPD";
          } else if (ctrlModReqRaw == TRQ_MODE) {
            mode_str = "TRQ";
          } else if (ctrlModReqRaw == VLT_MODE) {
            mode_str = "VLT";
          }

          if (!tel_filter_init) {
            rpm_tel_filt = rpm_meas;
            iA_tel_filt = iA;
            tel_filter_init = 1;
          } else {
            rpm_tel_filt += (int16_t)((rpm_meas - rpm_tel_filt) / 4);
            iA_tel_filt += (int16_t)((iA - iA_tel_filt) / 4);
          }
          telemetry_seq++;
          uint8_t chg = (HAL_GPIO_ReadPin(CHARGER_PORT, CHARGER_PIN) == GATE_CHARGER_ACTIVE_LEVEL) ? 1u : 0u;

          int32_t bat_cV = (int32_t)batVoltageCalib;
          int len = snprintf(
            tel_buf,
            sizeof(tel_buf),
            "TEL,seq=%lu,dir=%d,rpm=%d,dist_mm=%ld,fault=%u,bat_cV=%ld,iA=%d,armed=%u,mode=%s,eb=%u,cmd_age_ms=%lu,chg=%u,ack=%u\n",
            (unsigned long)telemetry_seq,
            dir,
            rpm_tel_filt,
            (long)dist_mm,
            (unsigned)fault,
            (long)bat_cV,
            iA_tel_filt,
            (unsigned)hb_motor_armed,
            mode_str,
            (unsigned)eb_enabled,
            (unsigned long)hb_cmd_age_ms,
            (unsigned)chg,
            (unsigned)last_cmd_seq
          );
          if (len < 0) {
            len = 0;
          } else if (len >= (int)sizeof(tel_buf)) {
            len = (int)sizeof(tel_buf) - 1;
          }


